In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
dates = pd.date_range('20130101', periods = 6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
type(dates)

pandas.core.indexes.datetimes.DatetimeIndex

In [3]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.202349 -1.271404  0.156642 -0.020021
2013-01-02  0.597636  0.318719  0.826905  1.915594
2013-01-03 -1.052548 -0.185888  1.407573 -1.364029
2013-01-04 -0.037715  0.167792 -2.079199 -0.037234
2013-01-05 -0.874310  1.191137 -0.490375  1.267905
2013-01-06 -1.011808 -0.670621 -0.677789 -1.461295

In [9]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [11]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
df.values

array([[-0.44901986,  0.95297234,  1.76277521, -0.3350117 ],
       [ 1.07164497,  0.48558584,  1.02028781,  1.02455505],
       [ 0.95715865,  0.26391086,  0.00766937, -0.64563246],
       [ 1.97293541, -1.36074469, -1.370743  , -0.5210014 ],
       [-0.33407939,  0.61389402, -0.79867077,  0.66621588],
       [ 1.65766429, -1.01107767, -1.54423433, -0.6029136 ]])

In [14]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01 -0.335012  1.762775  0.952972 -0.449020
2013-01-02  1.024555  1.020288  0.485586  1.071645
2013-01-03 -0.645632  0.007669  0.263911  0.957159
2013-01-04 -0.521001 -1.370743 -1.360745  1.972935
2013-01-05  0.666216 -0.798671  0.613894 -0.334079
2013-01-06 -0.602914 -1.544234 -1.011078  1.657664

In [15]:
df.sort_values(by = 'B')

                   A         B         C         D
2013-01-04  1.972935 -1.360745 -1.370743 -0.521001
2013-01-06  1.657664 -1.011078 -1.544234 -0.602914
2013-01-03  0.957159  0.263911  0.007669 -0.645632
2013-01-02  1.071645  0.485586  1.020288  1.024555
2013-01-05 -0.334079  0.613894 -0.798671  0.666216
2013-01-01 -0.449020  0.952972  1.762775 -0.335012

In [16]:
df['A']

2013-01-01   -0.449020
2013-01-02    1.071645
2013-01-03    0.957159
2013-01-04    1.972935
2013-01-05   -0.334079
2013-01-06    1.657664
Freq: D, Name: A, dtype: float64

In [17]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.449020  0.952972  1.762775 -0.335012
2013-01-02  1.071645  0.485586  1.020288  1.024555
2013-01-03  0.957159  0.263911  0.007669 -0.645632

In [18]:
df['20130102':'20130105']

                   A         B         C         D
2013-01-02  1.071645  0.485586  1.020288  1.024555
2013-01-03  0.957159  0.263911  0.007669 -0.645632
2013-01-04  1.972935 -1.360745 -1.370743 -0.521001
2013-01-05 -0.334079  0.613894 -0.798671  0.666216

### Selection by Label
 - loc
 - 행 자리에는 index name
 - 열 자리에는 colum name
 - 행, 열 자리에 : 표시를 하세되면 모두 출력

In [21]:
df.loc[dates[0]]

A   -0.449020
B    0.952972
C    1.762775
D   -0.335012
Name: 2013-01-01 00:00:00, dtype: float64

In [38]:
df.loc['20130101':'20130104', ['A','B']]

                   A         B
2013-01-01 -0.449020  0.952972
2013-01-02  1.071645  0.485586
2013-01-03  0.957159  0.263911
2013-01-04  1.972935 -1.360745

In [30]:
df.loc['20130101':'20130104', :]

                   A         B         C         D
2013-01-01 -0.449020  0.952972  1.762775 -0.335012
2013-01-02  1.071645  0.485586  1.020288  1.024555
2013-01-03  0.957159  0.263911  0.007669 -0.645632
2013-01-04  1.972935 -1.360745 -1.370743 -0.521001

하나의 row, 2개 이상의 컬럼으로 슬라이싱 할 경우 series 객체로 반환

In [35]:
df.loc['20130101', ['A','B']]

A   -0.449020
B    0.952972
Name: 2013-01-01 00:00:00, dtype: float64

하나의 row, 하나의 col 으로 슬라이싱 할 경우 scalar value로 반환

In [37]:
df.loc['20130101', 'A']
# df.at[dates[0], 'A'] 동일한 방법

-0.4490198568439077

### Selection by Position¶
- iloc 
- location 의 index로 슬라이싱

In [40]:
df.iloc[3]
# 2013-01-04 0123 => 에 해당하는 데이터

A    1.972935
B   -1.360745
C   -1.370743
D   -0.521001
Name: 2013-01-04 00:00:00, dtype: float64

In [41]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  1.972935 -1.360745
2013-01-05 -0.334079  0.613894

In [42]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  1.071645  1.020288
2013-01-03  0.957159  0.007669
2013-01-05 -0.334079 -0.798671

In [43]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.071645  0.485586  1.020288  1.024555
2013-01-03  0.957159  0.263911  0.007669 -0.645632

In [46]:
df.iloc[1,1]
# df.iat[1,1]

0.48558584142676864

### Boolean indexing
- 조건식을 주고 True, False로 슬라이싱

In [47]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  1.071645  0.485586  1.020288  1.024555
2013-01-03  0.957159  0.263911  0.007669 -0.645632
2013-01-04  1.972935 -1.360745 -1.370743 -0.521001
2013-01-06  1.657664 -1.011078 -1.544234 -0.602914

In [48]:
df[df>0]

                   A         B         C         D
2013-01-01       NaN  0.952972  1.762775       NaN
2013-01-02  1.071645  0.485586  1.020288  1.024555
2013-01-03  0.957159  0.263911  0.007669       NaN
2013-01-04  1.972935       NaN       NaN       NaN
2013-01-05       NaN  0.613894       NaN  0.666216
2013-01-06  1.657664       NaN       NaN       NaN

In [50]:
df2 = df.copy()
df2['E'] = ['one','one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.449020  0.952972  1.762775 -0.335012    one
2013-01-02  1.071645  0.485586  1.020288  1.024555    one
2013-01-03  0.957159  0.263911  0.007669 -0.645632    two
2013-01-04  1.972935 -1.360745 -1.370743 -0.521001  three
2013-01-05 -0.334079  0.613894 -0.798671  0.666216   four
2013-01-06  1.657664 -1.011078 -1.544234 -0.602914  three

### 특정값이 존재하는 행 슬라이싱
- isin
- df[df[열이름].isin([리스트값])]

In [56]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.957159  0.263911  0.007669 -0.645632   two
2013-01-05 -0.334079  0.613894 -0.798671  0.666216  four

In [59]:
s1 = pd.Series([1,2,3,4,5,6], index = pd.date_range('2013-01-02',periods=6))

In [68]:
df['F']=s1

In [64]:
df.at[dates[0], 'A'] = 0

In [66]:
df.iat[0,1] = 0

In [69]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [71]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.762775  5  NaN
2013-01-02  1.071645  0.485586  1.020288  5  1.0
2013-01-03  0.957159  0.263911  0.007669  5  2.0
2013-01-04  1.972935 -1.360745 -1.370743  5  3.0
2013-01-05 -0.334079  0.613894 -0.798671  5  4.0
2013-01-06  1.657664 -1.011078 -1.544234  5  5.0

### DF의 모든 값 양수 or 음수로 바꾸기

In [ ]:
df2 = df.copy()
df2[df2 > 0] = -df2

In [74]:
df2

                   A         B         C  D    F
2013-01-01  0.000000  0.000000 -1.762775 -5  NaN
2013-01-02 -1.071645 -0.485586 -1.020288 -5 -1.0
2013-01-03 -0.957159 -0.263911 -0.007669 -5 -2.0
2013-01-04 -1.972935 -1.360745 -1.370743 -5 -3.0
2013-01-05 -0.334079 -0.613894 -0.798671 -5 -4.0
2013-01-06 -1.657664 -1.011078 -1.544234 -5 -5.0

### Missing Data

In [78]:
df1 = df.reindex(index = dates[0:4],
                columns=list(df.columns) + ['E'])

df1.loc[dates[0]:dates[1], 'E'] = 1
df1

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.762775  5  NaN  1.0
2013-01-02  1.071645  0.485586  1.020288  5  1.0  1.0
2013-01-03  0.957159  0.263911  0.007669  5  2.0  NaN
2013-01-04  1.972935 -1.360745 -1.370743  5  3.0  NaN

#### dropna(how = 'any') : NA포함 데이터 모두 삭제

In [80]:
df1.dropna(how='any')

                   A         B         C  D    F    E
2013-01-02  1.071645  0.485586  1.020288  5  1.0  1.0

#### fillna : NA에 특정값 채우기

In [81]:
df1.fillna(value = 5)

                   A         B         C  D    F    E
2013-01-01  0.000000  0.000000  1.762775  5  5.0  1.0
2013-01-02  1.071645  0.485586  1.020288  5  1.0  1.0
2013-01-03  0.957159  0.263911  0.007669  5  2.0  5.0
2013-01-04  1.972935 -1.360745 -1.370743  5  3.0  5.0

In [82]:
pd.isna(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

In [85]:
df.mean()

A    0.887554
B   -0.168072
C   -0.153819
D    5.000000
F    3.000000
dtype: float64

In [86]:
df.mean(1)

2013-01-01    1.690694
2013-01-02    1.715504
2013-01-03    1.645748
2013-01-04    1.448290
2013-01-05    1.696229
2013-01-06    1.820470
Freq: D, dtype: float64

In [87]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [89]:
df.sub(s, axis = 'index')

                   A         B         C    D    F
2013-01-01       NaN       NaN       NaN  NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN  NaN
2013-01-03 -0.042841 -0.736089 -0.992331  4.0  1.0
2013-01-04 -1.027065 -4.360745 -4.370743  2.0  0.0
2013-01-05 -5.334079 -4.386106 -5.798671  0.0 -1.0
2013-01-06       NaN       NaN       NaN  NaN  NaN

In [93]:
df

                   A         B         C  D    F
2013-01-01  0.000000  0.000000  1.762775  5  NaN
2013-01-02  1.071645  0.485586  1.020288  5  1.0
2013-01-03  0.957159  0.263911  0.007669  5  2.0
2013-01-04  1.972935 -1.360745 -1.370743  5  3.0
2013-01-05 -0.334079  0.613894 -0.798671  5  4.0
2013-01-06  1.657664 -1.011078 -1.544234  5  5.0

In [95]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-01  0.000000  0.000000  1.762775   5   NaN
2013-01-02  1.071645  0.485586  2.783063  10   1.0
2013-01-03  2.028804  0.749497  2.790732  15   3.0
2013-01-04  4.001739 -0.611248  1.419989  20   6.0
2013-01-05  3.667660  0.002646  0.621319  25  10.0
2013-01-06  5.325324 -1.008432 -0.922916  30  15.0

In [96]:
df.apply(lambda x : x.max() - x.min())

A    2.307015
B    1.974639
C    3.307010
D    0.000000
F    4.000000
dtype: float64

In [97]:
df.apply(lambda x : x.max() - x.min(), 1)

2013-01-01    5.000000
2013-01-02    4.514414
2013-01-03    4.992331
2013-01-04    6.370743
2013-01-05    5.798671
2013-01-06    6.544234
Freq: D, dtype: float64

In [98]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -1.611451  1.122383  0.940773  0.108283
1 -0.609427 -0.388434  0.137304  0.702727
2 -0.246563 -2.176778  0.373737  1.445015
3  1.170284 -0.654034 -0.378827 -0.202772
4  1.945779  1.218251 -1.346228 -1.079953
5 -0.713391  0.844181 -2.599826  0.474972
6  1.319817 -2.107294 -0.245993  0.502264
7  1.990950  0.081605 -0.707023  1.130070
8 -0.338944 -1.185231 -1.399998 -1.588374
9  1.248961  0.352023  0.791107  1.682191

In [100]:
[df[:3], df[3:7], df[7:]]

[          0         1         2         3
 0 -1.611451  1.122383  0.940773  0.108283
 1 -0.609427 -0.388434  0.137304  0.702727
 2 -0.246563 -2.176778  0.373737  1.445015,
           0         1         2         3
 3  1.170284 -0.654034 -0.378827 -0.202772
 4  1.945779  1.218251 -1.346228 -1.079953
 5 -0.713391  0.844181 -2.599826  0.474972
 6  1.319817 -2.107294 -0.245993  0.502264,
           0         1         2         3
 7  1.990950  0.081605 -0.707023  1.130070
 8 -0.338944 -1.185231 -1.399998 -1.588374
 9  1.248961  0.352023  0.791107  1.682191]

In [103]:
pd.concat([df[:3], df[3:7], df[7:]])

          0         1         2         3
0 -1.611451  1.122383  0.940773  0.108283
1 -0.609427 -0.388434  0.137304  0.702727
2 -0.246563 -2.176778  0.373737  1.445015
3  1.170284 -0.654034 -0.378827 -0.202772
4  1.945779  1.218251 -1.346228 -1.079953
5 -0.713391  0.844181 -2.599826  0.474972
6  1.319817 -2.107294 -0.245993  0.502264
7  1.990950  0.081605 -0.707023  1.130070
8 -0.338944 -1.185231 -1.399998 -1.588374
9  1.248961  0.352023  0.791107  1.682191

In [104]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [106]:
pd.merge(left, right, on = 'key',)

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [107]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.013719 -1.707680  1.368256 -0.577702
1 -0.311410 -1.280984 -0.276547  0.513658
2 -0.938095 -0.038039  0.010607  0.778463
3 -0.217363  0.423224  0.386370 -0.098275
4 -1.329707  0.470238 -1.887431  1.358255
5  0.256719  0.064281  0.502928 -0.125187
6 -0.052955 -0.204053 -0.188279 -0.310139
7 -1.239054  2.340323 -0.299064  0.320127

In [109]:
df.iloc[3]

A   -0.217363
B    0.423224
C    0.386370
D   -0.098275
Name: 3, dtype: float64

In [111]:
s = df.iloc[3]
df.append(s, ignore_index = True)

          A         B         C         D
0  0.013719 -1.707680  1.368256 -0.577702
1 -0.311410 -1.280984 -0.276547  0.513658
2 -0.938095 -0.038039  0.010607  0.778463
3 -0.217363  0.423224  0.386370 -0.098275
4 -1.329707  0.470238 -1.887431  1.358255
5  0.256719  0.064281  0.502928 -0.125187
6 -0.052955 -0.204053 -0.188279 -0.310139
7 -1.239054  2.340323 -0.299064  0.320127
8 -0.217363  0.423224  0.386370 -0.098275

In [113]:
df.append(s, ignore_index = False)

          A         B         C         D
0  0.013719 -1.707680  1.368256 -0.577702
1 -0.311410 -1.280984 -0.276547  0.513658
2 -0.938095 -0.038039  0.010607  0.778463
3 -0.217363  0.423224  0.386370 -0.098275
4 -1.329707  0.470238 -1.887431  1.358255
5  0.256719  0.064281  0.502928 -0.125187
6 -0.052955 -0.204053 -0.188279 -0.310139
7 -1.239054  2.340323 -0.299064  0.320127
3 -0.217363  0.423224  0.386370 -0.098275

In [6]:
 df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar',
                           'foo', 'bar', 'foo', 'foo'],
                    'B' : ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                    'C' : np.random.randn(8),
                    'D' : np.random.randn(8)})

In [117]:
df

     A      B         C         D
0  foo    one -0.838385  0.038121
1  bar    one  1.290390 -0.487541
2  foo    two -1.005888 -0.517034
3  bar  three  0.516635 -0.202322
4  foo    two  0.211190 -2.198168
5  bar    two -1.794997  1.311365
6  foo    one -0.273994  1.024445
7  foo  three -0.475660  0.407759

In [119]:
df.groupby('A').sum()

            C         D
A
bar  0.012028  0.621502
foo -2.382737 -1.244877

In [123]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    1.290390 -0.487541
    three  0.516635 -0.202322
    two   -1.794997  1.311365
foo one   -1.112379  1.062566
    three -0.475660  0.407759
    two   -0.794698 -2.715202

In [7]:
temp = df.groupby(['A','B']).sum()
temp

                  C         D
A   B
bar one    0.275174  0.872102
    three  0.536879 -3.936186
    two    0.055877 -0.099935
foo one    2.646174  1.297944
    three  0.192560 -0.945870
    two    0.314815  1.923499

In [19]:
df.groupby(['B']).get_group('one')

     A    B         C         D
0  foo  one  1.938880  1.146232
1  bar  one  0.275174  0.872102
6  foo  one  0.707294  0.151712

In [23]:
from pymongo import MongoClient
client = MongoClient('localhost', 27017)
db = client.get_database('crawler')

In [24]:
db.sg_sitemap.find({'status_code':404}).count()

C:\Users\ff\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning: count is deprecated. Use Collection.count_documents instead.
  """Entry point for launching an IPython kernel.

129